/*==============================================================================
	[Actor2DManager.cpp]
														Author	:	Keigo Hara
==============================================================================*/
//------------------------------------------------------------------------------
// インクルードファイル
//------------------------------------------------------------------------------
#include "../../h/2D/Actor2DManager.h"
#include "../../h/2D/Actor2D.h"

//------------------------------------------------------------------------------
// using namespace
//------------------------------------------------------------------------------
using namespace idea;

//------------------------------------------------------------------------------
// 登録
//------------------------------------------------------------------------------
void Actor2DManager::Register(Actor2D* pActor2D)
{
	// NULLチェック,登録済みチェック
	if(!pActor2D || pActor2D->bRegistered_){
		return;
	}

	// リストに追加
	list_.push_back(pActor2D);

	// 登録済みに
	pActor2D->bRegistered_ = true;
}

//------------------------------------------------------------------------------
// 登録解除
//------------------------------------------------------------------------------
void Actor2DManager::UnRegister(Actor2D* pActor2D)
{
	// NULLチェック,削除済みチェック
	if(!pActor2D || !pActor2D->bRegistered_){
		return;
	}

	// リストに存在すれば削除
	auto actor = std::find(list_.begin(), list_.end(), pActor2D);

	if(actor != list_.end()){
		list_.erase(actor);
	}

	pActor2D->bRegistered_ = false;	// 削除済みに
}

//------------------------------------------------------------------------------
// 座標の保持
//------------------------------------------------------------------------------
void Actor2DManager::UpdatePrePosition()
{
	// リストから更新命令
	for(auto actor : list_){
		actor->UpdatePrePosition();
	}
}
