/*==============================================================================
	[Mask.h]
														Author	:	Keigo Hara
==============================================================================*/
#ifndef INCLUDE_IDEA_MASK_H
#define INCLUDE_IDEA_MASK_H

namespace idea{
	//------------------------------------------------------------------------------
	// クラス名　：Mask
	// クラス概要：マスクによる透過処理を行う関数群,2D描画のみに適用できる
	//------------------------------------------------------------------------------
	class Mask{
	public:
		// マスクへの書き込み開始
		bool DrawMask(bool bVisible = false);

		// マスクに書き込まれた範囲のみ描画する
		bool DrawAnd();

		// マスクに書き込まれた範囲以外描画する
		bool DrawXor();

		// マスク処理の終了
		bool EndMask();
	};
}

#endif	// #ifndef INCLUDE_IDEA_MASK_H