/*==============================================================================
	[ButtonSprite.h]
														Author	:	Keigo Hara
==============================================================================*/
#ifndef INCLUDE_IDEA_BUTTONSPRITE_H
#define INCLUDE_IDEA_BUTTONSPRITE_H

//------------------------------------------------------------------------------
// インクルードファイル
//------------------------------------------------------------------------------
#include "Sprite.h"

namespace idea{
	//------------------------------------------------------------------------------
	// 前方宣言
	//------------------------------------------------------------------------------
	class Mouse;

	//------------------------------------------------------------------------------
	// クラス名　：ButtonSprite
	// クラス概要：Spriteを継承したクラス
	// 　　　　　　マウスポインタに反応する機能を拡張
	//------------------------------------------------------------------------------
	class ButtonSprite : public Sprite{
	public:
		// マウスポインタが重なっているか
		bool IsRidingMousePointer(Mouse& mouse);
	};
}

#endif	// #ifndef INCLUDE_IDEA_BUTTONSPRITE_H