/*==============================================================================
	[Fade.cpp]
														Author	:	Keigo Hara
==============================================================================*/
#include "../../h/Framework/Fade.h"
#include "../../h/Framework/FadeManager.h"

using namespace idea;

//------------------------------------------------------------------------------
// フェードの設定
//------------------------------------------------------------------------------
void Fade::SetFade(int time, const Color& color)
{
	FadeManager::Instance().SetFade(time, color.r, color.g, color.b);
}

//------------------------------------------------------------------------------
// フェードの設定
//------------------------------------------------------------------------------
void Fade::SetFade(int time, float r, float g, float b)
{
	FadeManager::Instance().SetFade(time, r, g, b);
}

//------------------------------------------------------------------------------
// フェード中か
//------------------------------------------------------------------------------
bool Fade::IsFading()
{
	return FadeManager::Instance().IsFading();
}

//------------------------------------------------------------------------------
// フェードアウトが完了したか
//------------------------------------------------------------------------------
bool Fade::IsFadeOutCompleted()
{
	return FadeManager::Instance().IsFadeOutCompleted();
}